# MONARCH MIGRATION 1994 - 2001

In [1]:
import pandas as pd
import sqlite3
import os

In [2]:
db = sqlite3.connect("Monarchs.db")

### Read CSV for each year

In [18]:
monarchs2001 = pd.read_pickle("Data\Monarchs2001.pkl")
monarchs2000 = pd.read_pickle("Data\Monarchs2000.pkl")
monarchs1999 = pd.read_pickle("Data\Monarchs1999.pkl")
monarchs1998 = pd.read_pickle("Data\Monarchs1998.pkl")
monarchs1997 = pd.read_pickle("Data\Monarchs1997.pkl")
monarchs1996 = pd.read_pickle("Data\Monarchs1996.pkl")
monarchs1995 = pd.read_pickle("Data\Monarchs1995.pkl")
monarchs1994 = pd.read_pickle("Data\Monarchs1994.pkl")

### Convert pandas to SQL table

In [19]:
monarchs2001.to_sql("Monarchs2001", db, if_exists="replace")
monarchs2000.to_sql("monarchs2000", db, if_exists="replace")
monarchs1999.to_sql("monarchs1999", db, if_exists="replace")
monarchs1998.to_sql("monarchs1998", db, if_exists="replace")
monarchs1997.to_sql("monarchs1997", db, if_exists="replace")
monarchs1996.to_sql("monarchs1996", db, if_exists="replace")
monarchs1995.to_sql("monarchs1995", db, if_exists="replace")
monarchs1994.to_sql("monarchs1994", db, if_exists="replace")

os.getcwd()

C:\Users\Arink\Anaconda3\lib\site-packages\pandas\core\generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

'C:\\Users\\Arink\\Desktop\\github\\CodeLou\\Monarchs'

### View Schema 
##### All CSVs have same columns (Previously cleaned in DATA folder)

In [20]:
data_type = pd.read_sql('SELECT * FROM PRAGMA_TABLE_INFO("monarchs2001")', db)
data_type

   cid            name       type  notnull dflt_value  pk
0    0           index    INTEGER        0       None   0
1    1         Tag No.       TEXT        0       None   0
2    2       Tag State       TEXT        0       None   0
3    3        Tag Date  TIMESTAMP        0       None   0
4    4    Report State       TEXT        0       None   0
5    5  Report Country       TEXT        0       None   0
6    6     Report Date  TIMESTAMP        0       None   0
7    7           Miles       REAL        0       None   0

### Combine all years

In [22]:
combine =  pd.concat([monarchs2001, monarchs2000, monarchs1999, monarchs1998, monarchs1997, monarchs1996, monarchs1995, monarchs1994], axis =0)
#combine.columns = ["tag_no", "tag_state", "tag_date","report_state", "report_country", "report_date", "miles"]
#combine["Tag Date"] = combine["Tag Date"].astype(str)
combine.to_sql("combine", db, if_exists="replace")
combine.dtypes

Tag No.                   object
Tag State                 object
Tag Date          datetime64[ns]
Report State              object
Report Country            object
Report Date       datetime64[ns]
Miles                     object
dtype: object

In [23]:
state_tally = pd.read_sql('SELECT `Tag State`, COUNT(*) AS "Recovered Tags" FROM combine GROUP BY `Tag State` ORDER BY `Tag State`', db)
state_tally

     Tag State  Recovered Tags
0         None             170
1           AR              33
2           CO               4
3         COAH               2
4           CT              45
5     Coahuila               5
6           DC               1
7           FL               9
8           GA               3
9           IA             573
10          IL             100
11          IN              54
12          KS             776
13          KY              14
14          LA               3
15          MA              14
16          MD              18
17          ME               7
18      MEXICO               2
19          MI              58
20          MN             479
21          MO              47
22          MS               2
23          MX              21
24          NC              13
25          ND              14
26          NE             119
27          NH               5
28          NJ              30
29          NY              48
30  Nuevo Leon               1
31          OH              91
32          OK             185
33         ONT              58
34          PA              60
35         QUE               7
36      Quebec               1
37          SC               9
38          SD             133
39          TN               2
40          TX             388
41          VA              35
42          VT               7
43          WI              64
44          WV              20
45          WY               3